In [5]:
import numpy as np
from pandas import Series

In [9]:
my_array = [100,200,300]
s1 = Series(my_array)
s1

0    100
1    200
2    300
dtype: int64

In [11]:
my_array = ([100,200,300])
s2 = Series(my_array)
s2

0    100
1    200
2    300
dtype: int64

In [12]:
my_array = ({"a":100 ,"b":200 , "c":300 ,"d":400 })
s3 = Series(my_array)
s3

a    100
b    200
c    300
d    400
dtype: int64

In [14]:
my_array = Series({"a":100 ,"b":200 ,"c":300 ,"d":400})
my_array.dtype

dtype('int64')

In [18]:
import numpy as np
from pandas import Series

In [20]:
my1 = Series([100,200,300] , index = ["hello", "world", "nice"])
my1

hello    100
world    200
nice     300
dtype: int64

In [23]:
# 딕셔너리에서 키가 인덱스
my2 = Series({"world":1, "test":2, "hello":3})
my2

world    1
test     2
hello    3
dtype: int64

In [25]:
# 시리즈 객체 전환
merge = my1 +  my2
merge

hello    103.0
nice       NaN
test       NaN
world    201.0
dtype: float64

In [27]:
# 연산을 수행
addon = my1 + 1000
addon

hello    1100
world    1200
nice     1300
dtype: int64

In [29]:
times = my1 * 5
times

hello     500
world    1000
nice     1500
dtype: int64

In [34]:
column = Series([188, 92, 45, 63, 79])

print("합계:", column.sum())
print("평균:", column.mean())
print("최대:", column.max())
print("최소:", column.min())
print("분산:", column.var())
print("표준편차:",column.std())
print("중앙값:", column.median())
print("1 사분위 수:", column.quantile(0.25))
print("2사분위 수:", column.quantile(0.5))
print("3사분위 수:", column.quantile(0.75))

합계: 467
평균: 93.4
최대: 188
최소: 45
분산: 3106.2999999999993
표준편차: 55.73419058351883
중앙값: 79.0
1 사분위 수: 63.0
2사분위 수: 79.0
3사분위 수: 92.0

In [38]:
# 샘플데이터 정의
column = Series(np.arange(0, 100, 10))
column

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [42]:
in1= column[column > 30]
in1

4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [49]:
in2 = column[column <70][column > 10] 
in2

2    20
3    30
4    40
5    50
6    60
dtype: int64

In [51]:
in3 = column[(column > 10) | (column >= 70)]
in3

2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [54]:
origin = Series(np.arange(0,100,10))
origin.info()

<class 'pandas.core.series.Series'>
RangeIndex: 10 entries, 0 to 9
Series name: None
Non-Null Count  Dtype
--------------  -----
10 non-null     int64
dtypes: int64(1)
memory usage: 212.0 bytes

In [56]:
x = origin.astype('float')
x

0     0.0
1    10.0
2    20.0
3    30.0
4    40.0
5    50.0
6    60.0
7    70.0
8    80.0
9    90.0
dtype: float64

In [77]:
scores = ({"국어":85 ,"영어":92 ,"수학":78 ,"과학":95 ,"사회":88})

s1 = Series(scores)
print(s1)
print("수학점수:", s1["수학"])

in1 = s1[s1>=90]
print("90점 이상인 과목:",in1)

print("평균점수:",s1.mean())

국어    85
영어    92
수학    78
과학    95
사회    88
dtype: int64
수학점수: 78
90점 이상인 과목: 영어    92
과학    95
dtype: int64
평균점수: 87.6

In [80]:
from pandas import DataFrame, read_csv, read_excel

In [82]:
grade_data = [[1,"남자",98,77,88,64],[2,"여자",88,90,62,72],[1,"남자",92,70,83,79],[3,"남자",63,60,31,70],[4,"남자",75,50,90,88]]

df = DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  남자  63  60  31  70
4  4  남자  75  50  90  88

In [87]:
# 인덱스와 칼럼 이름 지정하기

i_names = ['철수','영희','민철','수현','호영']
c_names = ['학년', '성별','국어','영어','수학','과학']
df = DataFrame(grade_data, index = i_names, columns = c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  남자  63  60  31  70
호영   4  남자  75  50  90  88

In [91]:
grade_dic = {
    "학년":[1,2,1,3,4],
    "성별":['남자','여자','남자','여자','남자'],
    "국어":[98,88,92,63,75],
    "영어":[77,90,70,60,50],
    "수학":[88,62,83,31,90],
    "과학":[64,72,79,70,88]
}

df = DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

In [93]:
df = DataFrame(grade_dic, index = ['철수','영희','민철','수현','호영'])
df.index.name = '이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [95]:
grade_list = [{"이름":"철수", "학년":"1","성별":"남자", "국어":98,"영어":77,"수학":88,"과학":64},
              {"이름":"영희", "학년":"2","성별":"여자", "국어":88,"영어":90,"수학":62,"과학":72},
              {"이름":"민철", "학년":"1","성별":"남자", "국어":92,"영어":70,"수학":83,"과학":79},
              {"이름":"수현", "학년":"3","성별":"여자", "국어":63,"영어":60,"수학":31,"과학":79},
              {"이름":"호영", "학년":"4","성별":"남자", "국어":75,"영어":50,"수학":90,"과학":88},
]

df = DataFrame(grade_list)
df

   이름 학년  성별  국어  영어  수학  과학
0  철수  1  남자  98  77  88  64
1  영희  2  여자  88  90  62  72
2  민철  1  남자  92  70  83  79
3  수현  3  여자  63  60  31  79
4  호영  4  남자  75  50  90  88

In [97]:
df2 = df.set_index('이름')
df2

   학년  성별  국어  영어  수학  과학
이름
철수  1  남자  98  77  88  64
영희  2  여자  88  90  62  72
민철  1  남자  92  70  83  79
수현  3  여자  63  60  31  79
호영  4  남자  75  50  90  88

In [99]:
df.set_index('이름', inplace = True)
df

   학년  성별  국어  영어  수학  과학
이름
철수  1  남자  98  77  88  64
영희  2  여자  88  90  62  72
민철  1  남자  92  70  83  79
수현  3  여자  63  60  31  79
호영  4  남자  75  50  90  88

In [101]:
df3 = df.reset_index()
df3

   이름 학년  성별  국어  영어  수학  과학
0  철수  1  남자  98  77  88  64
1  영희  2  여자  88  90  62  72
2  민철  1  남자  92  70  83  79
3  수현  3  여자  63  60  31  79
4  호영  4  남자  75  50  90  88

In [103]:
df3.reset_index()

   index  이름 학년  성별  국어  영어  수학  과학
0      0  철수  1  남자  98  77  88  64
1      1  영희  2  여자  88  90  62  72
2      2  민철  1  남자  92  70  83  79
3      3  수현  3  여자  63  60  31  79
4      4  호영  4  남자  75  50  90  88

In [107]:
df3.reset_index(drop=True)

   이름 학년  성별  국어  영어  수학  과학
0  철수  1  남자  98  77  88  64
1  영희  2  여자  88  90  62  72
2  민철  1  남자  92  70  83  79
3  수현  3  여자  63  60  31  79
4  호영  4  남자  75  50  90  88

In [109]:
df = read_csv("https://data.hossam.kr/data/grade.csv",encoding = 'euc-kr')
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [112]:
df = read_csv("https://data.hossam.kr/data/grade.csv",encoding = 'euc-kr', index_col = '이름')
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [115]:
df = read_excel("https://data.hossam.kr/data/grade.xlsx", index_col = '이름')
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80